## Day-002

**mumbai daily temparature Dataset : 1951-2024**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
climate_df = pd.read_csv('mumbai_Climate.csv')
climate_df

             Date Rain     Temp Max     Temp Min
0      01-01-1951  NaN  28.53000069  14.53999996
1      02-01-1951  NaN  28.85000038  14.47999954
2      03-01-1951  NaN  30.65999985  14.43000031
3      04-01-1951  NaN  30.13999939  14.35999966
4      05-01-1951  NaN  29.18000031  13.34000015
...           ...  ...          ...          ...
26801  18-06-2024   Tr         34.3         26.6
26802  19-06-2024   20         34.8         25.5
26803       45463   18         33.1         25.4
26804       45464    4         30.9         26.7
26805       45465    0        -----        -----

[26806 rows x 4 columns]

In [3]:
climate_df.shape

(26806, 4)

In [4]:
climate_df.head()

         Date Rain     Temp Max     Temp Min
0  01-01-1951  NaN  28.53000069  14.53999996
1  02-01-1951  NaN  28.85000038  14.47999954
2  03-01-1951  NaN  30.65999985  14.43000031
3  04-01-1951  NaN  30.13999939  14.35999966
4  05-01-1951  NaN  29.18000031  13.34000015

In [5]:
climate_df.describe()

              Date  Rain Temp Max Temp Min
count        26806  1238    26806    26805
unique       26806   104     3993     4315
top     01-01-1951     0    -----       25
freq             1   788       58       82

In [6]:
climate_df.columns

Index(['Date', 'Rain', 'Temp Max', 'Temp Min'], dtype='object')

In [7]:
climate_df.dtypes

Date        object
Rain        object
Temp Max    object
Temp Min    object
dtype: object

In [8]:
climate_df['Date'] = climate_df['Date'].astype(str)
# this avoids silent type issues

In [9]:
climate_df.dtypes

Date        object
Rain        object
Temp Max    object
Temp Min    object
dtype: object

In [10]:
excel_mask = climate_df['Date'].str.isnumeric()

climate_df.loc[excel_mask, 'Date'] = pd.to_datetime(
    climate_df.loc[excel_mask, 'Date'].astype(int),
    unit='D',
    origin=1899-12-30
)

In [11]:
date_mask = excel_mask

climate_df.loc[date_mask, 'Date'] = pd.to_datetime(
    climate_df.loc[date_mask, 'Date'],
    dayfirst=True,
    errors='coerce'
)

In [12]:
climate_df['Date'] = pd.to_datetime(
    climate_df['Date'],
    errors='coerce'
)

In [13]:
climate_df['Date'].dtype

dtype('<M8[ns]')

In [14]:
climate_df['Date'].isna().sum()

np.int64(16231)

In [15]:
climate_df['Date'].min(), climate_df['Date'].max()

(Timestamp('1951-01-01 00:00:00'), Timestamp('2099-07-25 00:00:00'))

In [16]:
climate_df[climate_df['Date'].isna()]

      Date Rain     Temp Max     Temp Min
12     NaT  NaN  28.60000038  13.38000011
13     NaT  NaN  28.60000038  13.98999977
14     NaT  NaN  29.02000046  14.14000034
15     NaT  NaN  28.23999977  12.47000027
16     NaT  NaN  26.68000031  11.80000019
...    ...  ...          ...          ...
26798  NaT    4         32.7         26.4
26799  NaT    0         33.7         26.9
26800  NaT  0.3         34.3         27.6
26801  NaT   Tr         34.3         26.6
26802  NaT   20         34.8         25.5

[16231 rows x 4 columns]

**Day 02 -- Conclusion**

- I worked with a raw historical mumbai climate dataset to understand 
  real-world data quality challenges.
      
- This phase reinforced the importance of data cleaning as a prerequisite
  for reliable analytics and model development